IRP/src/AccumulationRegisters/RetailCash/RetailCash.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>RetailCash</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>Commission</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentType</name>
    <type>
      <types>CatalogRef.PaymentTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Account</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentTerminal</name>
    <type>
      <types>CatalogRef.PaymentTerminals</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BankTerm</name>
    <type>
      <types>CatalogRef.BankTerms</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/RetailCash/ManagerModule.bsl
Function GetLockFields(Data) Export
	Result = New Structure();
	Result.Insert("RegisterName"	, "AccumulationRegister.RetailCash");
	Fields = New Map();
	Fields.Insert("Company"			, "Company");
	Fields.Insert("PaymentType"		, "PaymentType");
	Fields.Insert("Account"			, "Account");
	Fields.Insert("PaymentTerminal"	, "PaymentTerminal");
	Fields.Insert("BankTerm"		, "BankTerm");
	Result.Insert("LockInfo"		, New Structure("Data, Fields", Data, Fields));
	Return Result;
EndFunction
